app/Http/Controllers/Frontend/ExtraController.php

    public function Home()
    {


        $sondakika = Cache()->remember("headline", Carbon::now()->addYear(), function () {
            if (Cache::has('headline')) return Cache::has('headline');
            return Post::where('posts.headline', 1)
                ->where('created_at', '>', Carbon::now()->subDay(1))
                ->where('status', 1)
                ->limit(5)
                ->get();
---
select * from `posts` where `posts`.`headline` = 1 and `created_at` > '2022-02-23 10:17:20' and `status` = 1 limit 5


        $date = Carbon::now()->format('d.m.Y');

        $vakit = Vakitler::where('date', $date)->get();
---
select * from `vakitlers` where `date` = '24.02.2022'

//                ->get();
////            });
//cache()->forget('home-surmanset');
        $surmanset = Cache()->remember("home-surmanset", Carbon::now()->addYear(), function () {
//            if (Cache::has('surmanset')) return Cache::has('surmanset');
            return Post::where('status', 1)

                ->with('category')
                ->limit(4)
                ->latest('created_at')
                ->get();
        });
---
select * from `posts` where `status` = 1 and `surmanset` = 1 order by `created_at` desc limit 4
select * from `categories` where `categories`.`id` in (1, 12)


        $sehir = Cache::remember("sehir", Carbon::now()->addYear(), function () {
            if (Cache::has('sehir')) return Cache::has('sehir');
            return Sehirler::orderByRaw('sehir_ad')->get();
---
select * from `sehirlers` order by sehir_ad

        $ilceler = Cache::remember("ilceler", Carbon::now()->addYear(), function () {
            if (Cache::has('ilceler')) return Cache::has('ilceler');
            //Buraya il seçtirerek ilçeler sıralanacak
            return Subdistrict::where('district_id', '=', '71')->orderByRaw('subdistrict_tr')->get();
---
select * from `subdistricts` where `district_id` = '71' order by subdistrict_tr

//        }
        $ucuncuSayfa = Cache::remember("ucuncuSayfa", Carbon::now()->addYear(), function () {
            if (Cache::has('ucuncuSayfa')) return Cache::has('ucuncuSayfa');
            return Post::where('category_id', 1)->where('status', 1)->where('featured', '=', 1)->limit(10)->latest('created_at')->get();
---
select * from `posts` where `category_id` = 1 and `status` = 1 and `featured` = 1 order by `created_at` desc limit 10

        });
        $ozel = Cache::remember("ozel", Carbon::now()->addYear(), function () {
            if (Cache::has('ozel')) return Cache::has('ozel');
            return Post::where('category_id', 1)->where('status', 1)->where('featured', '=', 1)->limit(10)->latest('created_at')->get();
---
select * from `posts` where `category_id` = 1 and `status` = 1 and `featured` = 1 order by `created_at` desc limit 10

        });
        $gundemcard = Cache::remember("gundemcard", Carbon::now()->addYear(), function () {
            if (Cache::has('gundemcard')) return Cache::has('gundem');
            return Post::where('category_id', '=', 2)->where('status', 1)->limit(3)->latest('created_at')->get();
        });
        $siyasetcard = Cache::remember("siyasetcard", Carbon::now()->addYear(), function () {
            if (Cache::has('siyasetcard')) return Cache::has('siyasetcard');
            return Post::where('category_id', '=', 3)->where('status', 1)->limit(3)->latest('created_at')->get();
        });
        $ekonomicard = Cache::remember("ekonomicard", Carbon::now()->addYear(), function () {
            if (Cache::has('ekonomicard')) return Cache::has('ekonomicard');
            return Post::where('category_id', '=', 5)->where('status', 1)->limit(3)->latest('created_at')->get();
        });

        $siyaset = Cache::remember("siyaset", Carbon::now()->addYear(), function () {
            if (Cache::has('siyaset')) return Cache::has('siyaset');
            return Post::where('category_id', '=', 3)->where('status', 1)->where('featured', '=', 1)->limit(10)->latest('created_at')->get();
        });

        $spor = Cache::remember("spor", Carbon::now()->addYear(), function () {
            if (Cache::has('spor')) return Cache::has('spor');
            return Post::where('category_id', '=', 6)->where('status', 1)->limit(10)->latest('created_at')->get();
        });
        $themeSetting = Cache::remember("themeSetting", Carbon::now()->addYear(), function () {
            if (Cache::has('themeSetting')) return Cache::has('themeSetting');
            return Theme::first();
---
select * from `posts` where `category_id` = 2 and `status` = 1 order by `created_at` desc limit 3
select * from `posts` where `category_id` = 3 and `status` = 1 order by `created_at` desc limit 3
select * from `posts` where `category_id` = 5 and `status` = 1 order by `created_at` desc limit 3
select * from `posts` where `category_id` = 2 and `featured` = 1 and `status` = 1 order by `created_at` desc limit 10
select * from `posts` where `category_id` = 3 and `status` = 1 and `featured` = 1 order by `created_at` desc limit 10
select * from `posts` where `category_id` = 6 and `status` = 1 order by `created_at` desc limit 10
select * from `themes` limit 1

        $category2=$themeSetting->category2;
        $education  = Cache::remember("kultur", Carbon::now()->addYear(), function () use ($category1) {
            if (Cache::has('kultur')) return Cache::has('kultur');
            return Post::where('category_id', '=', $category1)->status()
                ->where('featured',1)
                ->limit(4)->latest('created_at')->get();
        });
         $kultur= Cache::remember("education", Carbon::now()->addYear(), function () use ($category2) {
            if (Cache::has('education')) return Cache::has('education');
            return Post::where('category_id', '=', $category2)->status()
                ->where('featured',1)
                ->limit(6)->latest('created_at')->get();
---
select * from `posts` where `category_id` = 1 and `status` = 1 and `featured` = 1 order by `created_at` desc limit 4
select * from `posts` where `category_id` = 2 and `status` = 1 and `featured` = 1 order by `created_at` desc limit 6

//            ->where('authors.status', 1)->where('authors_posts.status', 1)->orderBy('authors_posts.created_at','ASC')
//            ->groupBy("authors.id")
//            ->get();
        $authors = Authors::leftjoin('authors_posts', 'authors.id', '=', 'authors_posts.authors_id')
            ->where('authors.status', 1)->where('authors_posts.status', 1)
            ->whereRaw('authors_posts.id in (select max(id) from authors_posts group by (authors_posts.authors_id))')
            ->latest("authors_posts.created_at")->limit(8)
            ->get();
---
select * from `authors` left join `authors_posts` on `authors`.`id` = `authors_posts`.`authors_id` where `authors`.`status` = 1 and `authors_posts`.`status` = 1 and authors_posts.id in (select max(id) from authors_posts group by (authors_posts.authors_id)) order by `authors_posts`.`created_at` desc limit 8


        $seoset = Cache::remember("seoset", Carbon::now()->addYear(), function () {
            if (Cache::has('seoset')) return Cache::has('seoset');
            return Seos::first();
---
select * from `seos` limit 1


        });
$egazete= Cache()->remember("home-egazete", Carbon::now()->addYear(), function () {
    return Gazetesayis::latest()->where('status',1)->limit(9)->get();
---
select * from `gazetesayis` where `status` = 1 order by `created_at` desc limit 9

    public function CategoryPost($slug,$name, $id)
    {

        $category = Category::latest()->where('id', $id)->orderBy('id', 'desc')->first();
        $authors = Cache::remember("authors", Carbon::now()->addYear(), function () {
            if (Cache::has('authors')) return Cache::has('authors');
            return Authors::leftjoin('authors_posts', 'authors.id', '=', 'authors_posts.authors_id')
                ->select(['authors.*', 'authors_posts.title'])
                ->latest('created_at')->where('authors.status', 1)->where('authors_posts.status', 1)
                ->groupBy("authors.id")->latest("authors_posts.id")
                ->get();
        });
        $manset =
            Post::join('categories', 'posts.category_id', 'categories.id')
                ->select('posts.*', 'categories.category_tr', 'categories.category_en')
                ->where('posts.status', 1)
                ->where('posts.category_id', $id)->where('posts.manset', 1)
                ->orderBy('created_at', 'desc')
                ->limit(15)->get();


        $count = Post::join('categories', 'posts.category_id', 'categories.id')
            ->select('posts.*', 'categories.category_tr', 'categories.category_en')
            ->where('posts.status', 1)
            ->where('posts.category_id', $id)
            ->count();


        $catpost = Post::join('categories', 'posts.category_id', 'categories.id')
            ->select('posts.*', 'categories.category_tr', 'categories.category_en')->where('posts.status', 1)
            ->where('posts.category_id', $id)->orWhere('posts.manset', NULL)->orderBy('created_at', 'desc')->offset(1)
            ->paginate(20);


        $nextnews = Post::join('categories', 'posts.category_id', 'categories.id')
            ->select('posts.*', 'categories.category_tr', 'categories.category_en')
            ->where('posts.category_id', $id)->where('posts.status', 1)->whereDate('posts.created_at', '>', \Carbon\Carbon::parse()->now()->subYear())
            ->inRandomOrder()->limit(10)
            ->get();
---
select * from `categories` where `id` = 'favicon.ico' order by `created_at` desc, `id` desc limit 1
select `authors`.*, `authors_posts`.`title` from `authors` left join `authors_posts` on `authors`.`id` = `authors_posts`.`authors_id` where `authors`.`status` = 1 and `authors_posts`.`status` = 1 group by `authors`.`id` order by `created_at` desc, `authors_posts`.`id` desc
select `posts`.*, `categories`.`category_tr`, `categories`.`category_en` from `posts` inner join `categories` on `posts`.`category_id` = `categories`.`id` where `posts`.`status` = 1 and `posts`.`category_id` = 'favicon.ico' and `posts`.`manset` = 1 order by `created_at` desc limit 15
select count(*) as aggregate from `posts` inner join `categories` on `posts`.`category_id` = `categories`.`id` where `posts`.`status` = 1 and `posts`.`category_id` = 'favicon.ico'
select `posts`.*, `categories`.`category_tr`, `categories`.`category_en` from `posts` inner join `categories` on `posts`.`category_id` = `categories`.`id` where `posts`.`status` = 1 and `posts`.`category_id` = 'favicon.ico' or `posts`.`manset` is null order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `posts` inner join `categories` on `posts`.`category_id` = `categories`.`id` where `posts`.`status` = 1 and `posts`.`category_id` = 'favicon.ico' or `posts`.`manset` is null
select `posts`.*, `categories`.`category_tr`, `categories`.`category_en` from `posts` inner join `categories` on `posts`.`category_id` = `categories`.`id` where `posts`.`category_id` = 'favicon.ico' and `posts`.`status` = 1 and date(`posts`.`created_at`) > '2021-02-24' order by RAND() limit 10