app/Http/Controllers/Backend/PostController.php

    public function index()
    {
        $post = Post::leftjoin('categories', 'posts.category_id', '=', 'categories.id')
            ->leftjoin('subcategories', 'posts.subcategory_id', '=', 'subcategories.id')
            ->leftjoin('districts', 'posts.district_id', '=', 'districts.id')
            ->leftjoin('subdistricts', 'posts.subdistrict_id', 'subdistricts.id')
            ->select(['posts.*', 'categories.category_tr', 'districts.district_tr', 'subdistricts.subdistrict_tr'])
            ->latest('id')
            ->paginate(20);
---
select `posts`.*, `categories`.`category_tr`, `districts`.`district_tr`, `subdistricts`.`subdistrict_tr` from `posts` left join `categories` on `posts`.`category_id` = `categories`.`id` left join `subcategories` on `posts`.`subcategory_id` = `subcategories`.`id` left join `districts` on `posts`.`district_id` = `districts`.`id` left join `subdistricts` on `posts`.`subdistrict_id` = `subdistricts`.`id` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `posts` left join `categories` on `posts`.`category_id` = `categories`.`id` left join `subcategories` on `posts`.`subcategory_id` = `subcategories`.`id` left join `districts` on `posts`.`district_id` = `districts`.`id` left join `subdistricts` on `posts`.`subdistrict_id` = `subdistricts`.`id`