app/Http/Controllers/Backend/WebsiteSettingController.php

    public function index()
    {
        //
        $websetting = WebsiteSetting::first();
---
select * from `website_settings` limit 1